app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at DESC
---
	def index
		@pins = Pin.all.order("created_at DESC")

INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def find_pin
		@pin = Pin.find(params[:id])